# Создайте скрипт бота, который находит ответы на фразы по ключу в словаре.
# Бот должен, как минимум, отвечать на фразы «привет», «как тебя зовут».
# Если фраза ему неизвестна, он выводит соответствующую фразу.

def answer(question):
    pass



user_input = input('Ваша фраза: ')
while (user_input.lower() != 'выход'):
    print(user_input)
    user_input = input('Ваша фраза: ')